Revit 2025 API
StoneApplicationType Enumeration
 The enumerated type representing the permitted values for the asset property "StoneApplication" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StoneApplicationType
Public Enumeration StoneApplicationType
public enum class StoneApplicationType
type StoneApplicationType
Members
Member name | Value | Description
Polished | 0
Glossy | 1
Matte | 2
Unfinished | 3
See Also
Reference
Autodesk.Revit.DB.Visual Namespace